[
  {
    "id": "ai-portfolio-search",
    "title": "AI-Powered Portfolio Search",
    "tagline": "Semantic search for photography portfolio using ML embeddings",
    "description": "Built a sophisticated search system for my photography portfolio that understands natural language queries. Uses Xenova's multilingual-e5-small model to generate embeddings for photos, combining semantic search with BM25 keyword matching through reciprocal rank fusion.\n\nThe system processes metadata (location, tags, camera settings) into searchable vectors, allowing queries like 'sunset beaches' or 'urban architecture' to find relevant photos beyond simple keyword matching. Implemented client-side for instant results with no backend dependencies.\n\nKey technical challenges included optimizing embedding generation for ~1000 photos, implementing efficient cosine similarity search in the browser, and balancing semantic vs keyword relevance through tuned RRF weights.",
    "featured": true,
    "featuredRank": 1,
    "featuredLabel": "Most Technically Complex",
    "techStack": ["react", "nextjs", "javascript", "openai", "ml"],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebhan/portfolio",
      "live": "https://calebhan.com/photography",
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/ai-search/thumb.png",
      "screenshots": [
        "/projects/ai-search/screen1.png",
        "/projects/ai-search/screen2.png"
      ]
    },
    "metadata": {
      "year": 2024,
      "status": "active",
      "complexity": "high"
    }
  },
  {
    "id": "3d-blackjack",
    "title": "3D Blackjack Game",
    "tagline": "A 3D blackjack game built with React, TypeScript, Three.js (via React Three Fiber), and Zustand.",
    "description": "3D Blackjack is a TypeScript + React game that renders a fully interactive blackjack table in 3D using React Three Fiber. It uses Zustand for state management and focuses on polished animations, predictable game logic, and performance-friendly rendering. Perfect for demos, learning Three.js with React, or playing a smooth single-player blackjack experience in the browser. Built for a Claude Builder's Club Mini Hackathon, winning 3rd Place.",
    "featured": true,
    "featuredRank": 2,
    "featuredLabel": "Most Interactive",
    "techStack": ["vite", "react", "typescript", "threejs", "zustand"],
    "category": "game",
    "links": {
      "github": "https://github.com/calebyhan/3d-blackjack",
      "live": "https://3d-blackjack.vercel.app/",
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/3d-blackjack/thumb.png",
      "screenshots": [
        "/projects/3d-blackjack/screen1.png"
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "completed",
      "complexity": "easy"
    }
  },
  {
    "id": "good-studio",
    "title": "Good Studio",
    "tagline": "AI-powered microsite builder for small nonprofits and community organizations",
    "description": "Good Studio helps tiny nonprofits, mutual-aid pods, and community organizers create beautiful, accessible websites without hiring a developer. Just provide your mission statement and logo — our multi-agent AI system handles the rest, streaming real-time progress as it works. Built for HackNC 2025, winning Best Use of Gemini API.",
    "featured": true,
    "featuredRank": 3,
    "featuredLabel": "Best UX Design",
    "techStack": ["react", "nextjs", "fastapi", "google-gemini", "supabase", "typescript", "python", "tailwind"],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebyhan/hacknc25",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/good-studio/thumb.png",
      "screenshots": [
        "/projects/good-studio/screen1.png",
        "/projects/good-studio/screen2.png"
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "completed",
      "complexity": "medium"
    }
  },
  {
    "id": "nebula",
    "title": "Nebula",
    "tagline": "Wasserstein GAN for generating realistic nebula images",
    "description": "Nebula implements a WGAN pipeline for generating and discriminating astrophotography-style nebula images. The repository contains training scripts (training.py), a Jupyter notebook with experiments and visualizations (training.ipynb), a generation utility (generate.py), and a discriminator test (test_discriminator.py). Image folders at multiple resolutions (64, 128, 256, 512) and example output images are included for experimentation and evaluation.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": ["python", "jupyter notebook", "numpy", "pillow", "matplotlib", "torch"],
    "category": "machine learning",
    "links": {
      "github": "https://github.com/calebyhan/nebula",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/nebula/thumb.png",
      "screenshots": [
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "completed",
      "complexity": "high"
    }
  },
  {
    "id": "graphsense",
    "title": "GraphSense",
    "tagline": "An AI-powered data visualization platform that automatically analyzes datasets and recommends optimal chart types using a sophisticated 3-agent pipeline powered by Google Gemini 2.0 Flash.",
    "description": "GraphSense is an intelligent data visualization platform that transforms raw data into meaningful insights through AI-powered analysis.The platform features an advanced infinite canvas where users can drag, organize, and interact with their visualizations. A smart minimap provides instant navigation across large projects, while viewport-aware chart placement ensures new visualizations always appear exactly where you're looking. Built for VTHacks 2025, winning Best Auto Visualization Agent.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": ["react", "nextjs", "fastapi", "google-gemini", "supabase", "typescript", "python", "tailwind"],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebyhan/vthacks25",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/graphsense/thumb.png",
      "screenshots": [
        "/projects/graphsense/screen1.png"
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "completed",
      "complexity": "medium"
    }
  },
  {
    "id": "ml-drift-detection",
    "title": "ML Drift Detection Learning Project",
    "tagline": "Interactive exploration of statistical drift detection for production ML monitoring",
    "description": "A hands-on learning project exploring statistical drift detection for production ML systems using the UCI Bike Sharing Dataset. Demonstrates when drift detection works, when it fails, and how to combine it with performance-based monitoring.\n\nIncludes four Jupyter notebooks covering data exploration, natural drift analysis (63% ridership increase between 2011-2012), synthetic experiments, and a 2×2 detection matrix for diagnosing drift types. Implements Population Stability Index (PSI) to measure distribution shifts across features.\n\nFeatures an interactive Next.js web interface with D3.js visualizations for exploring drift detection concepts without requiring Python. Includes animated histograms, real-time PSI gauges, an interactive drift simulator, and step-by-step explainer pages. Demonstrates three key insights: PSI alone is insufficient, feature importance matters, and combining statistical and performance metrics is essential for robust monitoring.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": [
      "python",
      "jupyter",
      "scikit-learn",
      "pandas",
      "numpy",
      "next.js",
      "typescript",
      "react",
      "d3.js",
      "framer motion",
      "tailwind"
    ],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebyhan/ml-drift-detection",
      "live": "https://ml-drift-detection.vercel.app",
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/ml-drift/thumb.png",
      "screenshots": [
        "/projects/ml-drift/screen1.png",
        "/projects/ml-drift/screen2.png"
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "completed",
      "complexity": "medium"
    }
  },
  {
    "id": "ml-sentiment-analyzer",
    "title": "Sentiment Analysis API",
    "tagline": "REST API for analyzing text sentiment using transformer models",
    "description": "Developed a high-performance sentiment analysis API using pre-trained transformer models. The service analyzes text input and returns sentiment scores (positive, negative, neutral) along with confidence levels and key phrases.\n\nBuilt with FastAPI for async request handling and HuggingFace Transformers for the ML models. Implemented model caching and batched inference to optimize throughput, achieving sub-100ms response times for typical requests.\n\nIncludes support for multiple languages, custom fine-tuning endpoints for domain-specific sentiment analysis, and detailed analytics showing sentiment distribution over time. Deployed using Docker with auto-scaling based on load.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": [],
    "category": "ai",
    "links": {
      "github": "https://github.com/calebhan/sentiment-api",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/sentiment/thumb.png",
      "screenshots": []
    },
    "metadata": {
      "year": 2024,
      "status": "active",
      "complexity": "high"
    }
  },
  {
    "id": "recipe-manager",
    "title": "Smart Recipe Manager",
    "tagline": "Recipe organization app with AI-powered meal planning",
    "description": "Created a recipe management application that helps users organize recipes, plan meals, and generate shopping lists. Uses AI to suggest recipes based on available ingredients and dietary preferences.\n\nBuilt with Next.js and MongoDB for flexible recipe storage. The AI meal planner uses GPT-4 to generate weekly meal plans considering nutritional balance, ingredient overlap to minimize waste, and user preferences.\n\nFeatures include recipe import from URLs with automatic parsing, nutritional information calculation, serving size adjustment, and ingredient substitution suggestions. Mobile-responsive design optimized for kitchen use.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": [],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebhan/recipe-manager",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/recipes/thumb.png",
      "screenshots": [
        "/projects/recipes/screen1.png",
        "/projects/recipes/screen2.png"
      ]
    },
    "metadata": {
      "year": 2024,
      "status": "active",
      "complexity": "medium"
    }
  },
  {
    "id": "code-snippet-manager",
    "title": "Developer Code Snippet Library",
    "tagline": "Personal knowledge base for code snippets with fuzzy search",
    "description": "Built a personal code snippet manager for organizing and quickly retrieving reusable code patterns. Features syntax highlighting for 50+ languages, tag-based organization, and fuzzy search to find snippets fast.\n\nImplemented using Electron for cross-platform desktop support with a local-first architecture. All data is stored in SQLite with full-text search capabilities. Includes VS Code extension for quick snippet insertion.\n\nSupports snippet templates with variable interpolation, version history for tracking changes, and export/import for sharing collections. Global keyboard shortcuts allow accessing snippets from any application.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": [],
    "category": "tools",
    "links": {
      "github": "https://github.com/calebhan/snippet-manager",
      "live": null,
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/snippets/thumb.png",
      "screenshots": []
    },
    "metadata": {
      "year": 2023,
      "status": "active",
      "complexity": "medium"
    }
  },
  {
    "id": "portfolio-website",
    "title": "Personal Portfolio Website",
    "tagline": "Modern portfolio showcasing photography and development work",
    "description": "Designed and built this portfolio website to showcase my photography and development projects. Features a clean, minimal design with smooth animations and transitions that enhance the user experience without overwhelming content.\n\nImplemented with Next.js for optimal performance with static site generation and image optimization. Uses anime.js for scroll-triggered animations and Intersection Observer for lazy loading. Achieved 100/100 Lighthouse scores across all metrics.\n\nIncludes advanced features like AI-powered search, interactive tech visualizations, and adaptive layouts that work seamlessly across devices. Built with accessibility in mind, supporting keyboard navigation and respecting user motion preferences.",
    "featured": false,
    "featuredRank": null,
    "featuredLabel": null,
    "techStack": ["react", "nextjs", "javascript", "tailwind", "ai", "animejs"],
    "category": "fullstack",
    "links": {
      "github": "https://github.com/calebyhan/calebhan",
      "live": "https://calebhan.top",
      "demo": null
    },
    "images": {
      "thumbnail": "/projects/portfolio/thumb.png",
      "screenshots": [
        "/projects/portfolio/screen1.png",
        "/projects/portfolio/screen2.png"
      ]
    },
    "metadata": {
      "year": 2025,
      "status": "active",
      "complexity": "high"
    }
  }
]
